Tekla.Structures.Drawing.MarkBase.MarkBaseAttributes.TextAlignOptions
Enumeration of the possible text alignment values.

Tekla.Structures.Drawing.MarkBase.MarkBaseAttributes.TextAlignOptions.Left
Text is left-aligned.

Tekla.Structures.Drawing.MarkBase.MarkBaseAttributes.TextAlignOptions.Center
Text is center-aligned.

Tekla.Structures.Drawing.MarkBase.MarkBaseAttributes.TextAlignOptions.Right
Text is right-aligned.